//
//  CreateCell.swift
//  ErrorNil_UIKit_HW5
//
//  Created by Юрий Мартыненко on 11.04.2024.
//

import Foundation


struct UserCell: Identifiable {
    var id: String = UUID().uuidString
    var userName: String
    var messages: [String]
    var image: String
}


let arrayOfMaleNames = ["Георгий Александров","Александр Кириллов", "Платон Борисов", "Георгий Коротков", "Андрей Пономарев", "Савелий Аксенов", "Максим Сергеев", "Павел Мельников", "Ян Крылов", "Роман Овчинников", "Глеб Орлов", "Сергей Малахов", "Дмитрий Алексеев", "Иван Иванов", "Михаил Кулешов", "Михаил Мартынов", "Максим Усов", "Александр Чистяков", "Роман Грачев", "Дмитрий Зубков", "Даниил Дорохов", "Иван Агапов", "Дмитрий Беликов", "Кирилл Кириллов", "Марк Иванов", "Артём Николаев", "Сергей Кузин", "Григорий Артемов", "Николай Захаров", "Ярослав Терехов", "Александр Соколов", "Иван Чернов", "Игорь Бондарев", "Матвей Золотов", "Вадим Климов", "Кирилл Соколов", "Кирилл Демин", "Антон Васильев", "Дмитрий Попов", "Роман Успенский", "Владислав Кузьмин", "Максим Федоров", "Всеволод Казаков", "Илья Широков", "Максим Кондратьев", "Кирилл Васильев", "Андрей Беспалов", "Мирослав Яковлев", "Егор Соловьев", "Тимофей Воробьев", "Александр Овчинников", "Игорь Ларин", "Данил Фирсов", "Арсений Никулин", "Андрей Калашников", "Константин Швецов", "Роман Кулешов", "Владислав Макаров", "Демид Ткачев", "Михаил Новиков", "Иван Поляков", "Роман Розанов", "Глеб Свиридов", "Владимир Муратов", "Даниил Тихонов", "Степан Максимов", "Кирилл Грачев", "Артём Зеленин", "Михаил Дорофеев", "Григорий Бобров", "Александр Жилин", "Даниил Кузнецов", "Александр Коновалов", "Егор Колесников", "Дмитрий Григорьев", "Михаил Громов", "Дмитрий Уткин", "Адам Орлов", "Алексей Козин", "Сергей Захаров", "Максим Богомолов", "Матвей Симонов", "Кирилл Федоров", "Егор Кузнецов", "Тихон Беспалов", "Иван Климов", "Алексей Новиков", "Алексей Щербаков", "Тимофей Родионов", "Филипп Молчанов", "Владислав Власов", "Владимир Романов", "Лев Владимиров", "Лев Горшков", "Евгений Богомолов", "Тимофей Одинцов", "Лев Сотников", "Никита Козлов", "Марк Васильев", "Ярослав Васильев"]

let arrayOfFemaleNames = ["Алёна Попова", "Милана Дмитриева", "Арина Петрова", "Софья Романова", "Диана Лопатина", "Мария Сидорова", "Злата Белова", "Елизавета Денисова", "Валерия Васильева", "Елизавета Максимова", "Ксения Олейникова", "Вероника Семенова", "Мария Зайцева", "Стефания Воронина", "Евгения Крючкова", "Василиса Попова", "Полина Орлова", "Алиса Герасимова", "Мария Титова", "Виктория Медведева", "Эмма Боброва", "Агния Митрофанова", "Ясмина Астафьева", "Кристина Андреева", "Ксения Ларионова", "Дарья Ермолаева", "Агата Андреева", "Мария Михайлова", "Мария Баженова", "Арина Михайлова", "Мария Воробьева", "Полина Дмитриева", "Мелания Абрамова", "Анастасия Соболева", "София Симонова", "Медина Троицкая", "Ника Ушакова", "Мария Чистякова", "Анна Николаева", "Кира Абрамова", "Полина Степанова", "Ника Тимофеева", "Мадина Галкина", "Ника Дорофеева", "Ариана Орлова", "Алиса Мартынова", "Станислава Морозова", "Злата Павлова", "Юлия Иванова", "Элина Казанцева", "Вероника Воронкова", "Ульяна Николаева", "София Филимонова", "Алёна Власова", "Алиса Лебедева", "Валерия Мартынова", "Есения Еремина", "Аделина Морозова", "Софья Орлова", "Виктория Попова", "Ясмина Головина", "Стефания Киселева", "Анна Малышева", "Варвара Анисимова", "Анастасия Кузьмина", "Анастасия Федорова", "Дарья Беляева", "Марина Баранова", "Виктория Кузнецова", "Анна Новикова", "Вера Серова", "Юлия Зайцева", "Лейла Семенова", "Мирослава Мельникова", "Есения Щукина", "Анна Астахова", "Дарья Николаева", "Мирослава Смирнова", "Оливия Александрова", "Дарья Самойлова", "Анна Шаповалова", "Вероника Беляева", "Екатерина Павлова", "Анастасия Филиппова", "Мария Смирнова", "Вероника Зубкова", "Сафия Куликова", "Владислава Тарасова", "Василиса Антонова", "Эмилия Беликова", "Любовь Семенова", "София Михайлова", "Алиса Зайцева", "Эмилия Левина", "Дарья Григорьева", "Алиса Крюкова", "Вероника Любимова", "Мария Наумова", "Александра Жданова", "Ирина Тихонова"]


func randomGeneratorName() -> String {
    let gender = ["male", "woman"]
}


func generatorCellUser() -> [UserCell]{
    let userCell: [UserCell] = []
    
    for _ in 1...Int.random(in: 15) {
        userCell.append(UserCell(userName: <#T##String#>, messages: <#T##[[String]]#>, image: <#T##String#>))
    }
    return userCell
}


